/*
* 파일명: "12x12MultiplicationT.cpp"
* 프로그램의 목적 및 기본 기능:
*	-12*12 곱셈표를 출력하는 프로그램
* 프로그램 작성자: 류효정 (2022년 03월 04일)
* 최종 수정 및 보완: 류효정 (2022년 03월 22일)
* ===========================================================================
* 프로그램 수정/보완 이력
* ===========================================================================
* 프로그램 수정/보완작업자       일자            수정/보완 내용
* 류효정                       2022.03.22      12*12 곱셈표 출력 완성
* ===========================================================================
*/
#include <stdio.h>
#define ROW 12
#define COL 12
int main(void)
{
	int table[ROW + 1][COL + 1] = {0};
	for (int i = 1; i <= ROW; i++)
	{
		for (int j = 1; j <= COL; j++)
			table[i][j] = i * j;
	}

	printf(">>> 12 X 12 Multiplication Table <<<\n\n");
	printf("    |");
	for (int n = 1; n < 13; n++)
	{
		printf("%5d", n);
	}
	printf("\n");
	printf("====+============================================================\n");
	for (int i = 1; i <= ROW; i++)
	{
		printf("%3d |", i);
		for (int j = 1; j <= COL; j++)
		{
			printf("%5d", table[i][j]);
		}
		printf("\n");
	}
	return 0;
}

